src/AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/AccountingRegisters/Управленческий/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОборотПоСчетуВразрезеСубконто(НачалоПериода
	                                         ,КонецПериода
											 ,СтруктурнаяЕдиница
											 ,Счет
											 ,Субконто1 = Неопределено 
											 ,Субконто2 = Неопределено
											 ,Субконто3 = Неопределено
											 ,Субконто4 = Неопределено 
											 ,ВРазрезеСубконто1 = Ложь
											 ,ВРазрезеСубконто2 = Ложь
										     ,ВРазрезеСубконто3 = Ложь
	                                         ,ВРазрезеСубконто4 = Ложь
	                                         ,ИсключитьРегистратор = Неопределено) Экспорт
	
      Запрос       = Новый Запрос;
	  Запрос.Текст = 
	  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	  |	УправленческийОбороты.Счет,
	  |	ВЫБОР
	  |		КОГДА &ВРазрезеСубконто1 = ИСТИНА
	  |			ТОГДА УправленческийОбороты.Субконто1
	  |	КОНЕЦ КАК Субконто1,
	  |	ВЫБОР
	  |		КОГДА &ВРазрезеСубконто2 = ИСТИНА
	  |			ТОГДА УправленческийОбороты.Субконто2
	  |	КОНЕЦ КАК Субконто2,
	  |	ВЫБОР
	  |		КОГДА &ВРазрезеСубконто3 = ИСТИНА
	  |			ТОГДА УправленческийОбороты.Субконто3
	  |	КОНЕЦ КАК Субконто3,
	  |	СУММА(УправленческийОбороты.СуммаОборот) КАК СуммаОборот,
	  |	СУММА(УправленческийОбороты.СуммаОборотДт) КАК СуммаОборотДт,
	  |	СУММА(УправленческийОбороты.СуммаОборотКт) КАК СуммаОборотКт
	  |ИЗ
	  |	РегистрБухгалтерии.Управленческий.Обороты(
	  |			&НачалоПериода,
	  |			&КонецПериода,
	  |			Авто,
	  |			Счет = &Счет,
	  |			,
	  |			ВЫБОР
	  |					КОГДА &СтруктурнаяЕдиница <> НЕОПРЕДЕЛЕНО
	  |							И &СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.Пустаяссылка)
	  |						ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	  |					ИНАЧЕ ИСТИНА
	  |				КОНЕЦ
	  |				И ВЫБОР
	  |					КОГДА &Субконто1 <> НЕОПРЕДЕЛЕНО
	  |						ТОГДА Субконто1 = &Субконто1
	  |					ИНАЧЕ ИСТИНА
	  |				КОНЕЦ
	  |				И ВЫБОР
	  |					КОГДА &Субконто2 <> НЕОПРЕДЕЛЕНО
	  |						ТОГДА Субконто2 = &Субконто2
	  |					ИНАЧЕ ИСТИНА
	  |				КОНЕЦ
	  |				И ВЫБОР
	  |					КОГДА &Субконто3 <> НЕОПРЕДЕЛЕНО
	  |						ТОГДА Субконто3 = &Субконто3
	  |					ИНАЧЕ ИСТИНА
	  |				КОНЕЦ
	  |				И ВЫБОР
	  |					КОГДА &Субконто4 <> НЕОПРЕДЕЛЕНО
	  |						ТОГДА Субконто4 = &Субконто4
	  |					ИНАЧЕ ИСТИНА
	  |				КОНЕЦ,
	  |			,
	  |			) КАК УправленческийОбороты
	  |ГДЕ
	  |	ВЫБОР
	  |			КОГДА &ИсключитьРегистратор <> НЕОПРЕДЕЛЕНО
	  |				ТОГДА УправленческийОбороты.Регистратор <> &ИсключитьРегистратор
	  |			ИНАЧЕ ИСТИНА
	  |		КОНЕЦ
	  |
	  |СГРУППИРОВАТЬ ПО
	  |	УправленческийОбороты.Счет,
	  |	ВЫБОР
	  |		КОГДА &ВРазрезеСубконто1 = ИСТИНА
	  |			ТОГДА УправленческийОбороты.Субконто1
	  |	КОНЕЦ,
	  |	ВЫБОР
	  |		КОГДА &ВРазрезеСубконто2 = ИСТИНА
	  |			ТОГДА УправленческийОбороты.Субконто2
	  |	КОНЕЦ,
	  |	ВЫБОР
	  |		КОГДА &ВРазрезеСубконто3 = ИСТИНА
	  |			ТОГДА УправленческийОбороты.Субконто3
	  |	КОНЕЦ";
	  
	  Запрос.УстановитьПараметр("НачалоПериода"        ,НачалоПериода);
	  Запрос.УстановитьПараметр("КонецПериода"         ,КонецПериода);
	  Запрос.УстановитьПараметр("Счет"                 ,Счет);
	  Запрос.УстановитьПараметр("ВРазрезеСубконто1"    ,ВРазрезеСубконто1);
	  Запрос.УстановитьПараметр("ВРазрезеСубконто2"    ,ВРазрезеСубконто2);
	  Запрос.УстановитьПараметр("ВРазрезеСубконто3"    ,ВРазрезеСубконто3);
	  Запрос.УстановитьПараметр("ИсключитьРегистратор" ,ИсключитьРегистратор);
	  Запрос.УстановитьПараметр("СтруктурнаяЕдиница"   ,СтруктурнаяЕдиница);
	  Запрос.УстановитьПараметр("Субконто1"            ,Субконто1);
	  Запрос.УстановитьПараметр("Субконто2"            ,Субконто2);
	  Запрос.УстановитьПараметр("Субконто3"            ,Субконто3);
	  Запрос.УстановитьПараметр("Субконто4"            ,Субконто4);

      Выборка = Запрос.Выполнить().Выгрузить();
	  
	  Возврат Выборка; 
	  
КонецФункции

#КонецОбласти
